print(set([1, 2, 3, 4]))           #вбудована функція
print(set('spam'))                 #додати всі елементи з ітерального об'єкта

print({1, 2, 3, 4})                #літерали множин

S = {'s', 'p', 'a', 'm'}
print(S)

S.add('alot')                      #методи працюють як і раніше
print(S)

S1 = {1, 2, 3, 4}
print(S1 & {1, 3})                 #пересічення
print({1, 5, 3, 6} | S1)           #об'єднання
print(S1 - {1, 3, 4})              #різниця
print(S1 > {1, 3})                 #надмножинність
print(S1 - {1, 2, 3, 4})           #пуста множинність виводиться по-іншому
print(type({}))                    #оскільки {} - це пустий словник

S = set()                          #ініціалізація пустої множності
S.add(1.23)
print(S)